1cdiplom/src/DataProcessors/МассовоеСозданиеАктов/МассовоеСозданиеАктов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>МассовоеСозданиеАктов</name>
  <attributes>
    <name>НачалоПериода</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КонецПериода</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ТабличнаяЧасть</name>
    <attributes>
      <name>Договор</name>
      <type>
        <types>CatalogRef.ДоговорыКонтрагентов</types>
      </type>
    </attributes>
    <attributes>
      <name>Реализация</name>
      <type>
        <types>DocumentRef.РеализацияТоваровУслуг</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

1cdiplom/src/Documents/РеализацияТоваровУслуг/РеализацияТоваровУслуг.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РеализацияТоваровУслуг</name>
  <registerRecords>AccumulationRegister.ОстаткиТоваров</registerRecords>
  <registerRecords>AccumulationRegister.ОбработкаЗаказов</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>DocumentRef.ЗаказПокупателя</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Услуги</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

1cdiplom/src/Catalogs/ДоговорыКонтрагентов/ДоговорыКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ДоговорыКонтрагентов</name>
  <owners>Catalog.Контрагенты</owners>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидДоговора</name>
    <type>
      <types>EnumRef.ВидыДоговоровКонтрагентов</types>
      <types>EnumRef.ВидыДоговоровКонтрагентов_Новый</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаДействияДоговора</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончанияДействияДоговора</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаЕжемесячнойАбонентскойПлаты</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтоимостьЧасаРаботыСпециалиста</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

1cdiplom/src/DataProcessors/МассовоеСозданиеАктов/Forms/ИнтерфейсОбработки/Module.bsl
&НаСервере
Процедура ПолучитьСписокДоговоровНаСервере()
	Если Не ЗначениеЗаполнено(Объект.НачалоПериода) Или Не ЗначениеЗаполнено(Объект.КонецПериода) Тогда
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = "Отсутствует диапазон выборки договоров обслуживания клиентов!";
		Сообщение.Сообщить();
	Иначе
		МесяцНачало = Месяц(Объект.НачалоПериода);
		МесяцКонец = Месяц(Объект.КонецПериода);
	
		Запрос = Новый Запрос;
		Запрос.Текст =
			"ВЫБРАТЬ
			|	ДоговорыКонтрагентов.Наименование КАК Договор
			|ИЗ
			|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
			|ГДЕ
			|	Месяц(ДоговорыКонтрагентов.ДатаНачалаДействияДоговора) >= &МесяцНачало
			|	Месяц(И ДоговорыКонтрагентов.ДатаОкончанияДействияДоговора) <= &МесяцКонец";
		
		Запрос.УстановитьПараметр("МесяцНачало", МесяцНачало);
		Запрос.УстановитьПараметр("МесяцКонец", МесяцКонец);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Выборка = РезультатЗапроса.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			Строка = Объект.ТабличнаяЧасть.Добавить();
			Строка.Договор = Выборка.Договор;
		КонецЦикла;
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьСписокДоговоров(Команда)
	ПолучитьСписокДоговоровНаСервере();
КонецПроцедуры

&НаСервере
Процедура СформироватьИЗакрытьНаСервере()
	Если Объект.ТабличнаяЧасть.Количество() = 0 Тогда
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = "Отсутствуют выбранные договора в указанном диапазоне!";
		Сообщение.Сообщить();
	Иначе
		МесяцНачало = Месяц(Объект.НачалоПериода);
		МесяцКонец = Месяц(Объект.КонецПериода);
		
		Для Каждого СтрокаТаблицы Из Объект.ТабличнаяЧасть.Выгрузить() Цикл
			НаличиеРеализации = Ложь;
					
			Запрос = Новый Запрос;
			Запрос.Текст =
				"ВЫБРАТЬ
				|	РеализацияТоваровУслуг.Ссылка
				|ИЗ
				|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
				|ГДЕ
				|	Месяц(РеализацияТоваровУслуг.Дата) = &МесяцНачала
				|   И Месяц(РеализацияТоваровУслуг.Дата) = &МесяцКонца
				|	И РеализацияТоваровУслуг.Договор.Наименование = &Наименование";
					
			Запрос.УстановитьПараметр("МесяцНачала", МесяцНачало);
			Запрос.УстановитьПараметр("МесяцКонца", МесяцКонец);
			Запрос.УстановитьПараметр("Наименование", СтрокаТаблицы.Договор);
			
			//@skip-check query-in-loop
			РезультатЗапроса = Запрос.Выполнить();
			
			ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
			
			Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
				НаличиеРеализации = Истина;
				Прервать;
			КонецЦикла;
			
			Если Не НаличиеРеализации = Ложь Тогда
				//не знаю как делать
			КонецЕсли;
		КонецЦикла
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СформироватьИЗакрыть(Команда)
	СформироватьИЗакрытьНаСервере();
КонецПроцедуры
